Product/trunk/DDPs/NetworkResourceBasic/IIS/xml/notify-ResourceAttributeValueChange.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1" xsi:schemaLocation="http://www.tmforum.org/mtop/nrb/xsd/rscavc/v1 ../xsd/EventResourceAttributeValueChange.xsd http://www.tmforum.org/mtop/nrf/xsd/me/v1 ../../../NetworkResourceFulfillment/IIS/xsd/Me.xsd http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1 ../../../Framework/IIS/xsd/NotificationMessages.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <m:header xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1">
      <m:activityName>Notification</m:activityName>
      <m:msgName>notify</m:msgName>
      <m:msgType>NOTIFICATION</m:msgType>
      <m:senderURI>http://www.altova.com</m:senderURI>
      <m:destinationURI>http://www.altova.com</m:destinationURI>
      <m:security>String</m:security>
      <m:securityType>String</m:securityType>
      <m:priority>String</m:priority>
      <m:msgSpecificProperties>
        <m:property>
          <m:propName>String</m:propName>
          <m:propValue>String</m:propValue>
        </m:property>
      </m:msgSpecificProperties>
      <m:communicationPattern>Notification</m:communicationPattern>
      <m:communicationStyle>RPC</m:communicationStyle>
      <m:timestamp>2001-12-17T09:30:47.0Z</m:timestamp>
      <m:vendorExtensions/>
    </m:header>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <m:notify xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1">
      <m:topic>String</m:topic>
      <m:message>
        <m0:resourceAttributeValueChange xmlns:m0="http://www.tmforum.org/mtop/nrb/xsd/rscavc/v1" xmlns:m1="http://www.tmforum.org/mtop/fmw/xsd/cei/v1" xmlns:m2="http://www.tmforum.org/mtop/fmw/xsd/ei/v1" xmlns:m3="http://www.tmforum.org/mtop/fmw/xsd/avc/v1">
          <m1:notificationId>String</m1:notificationId>
          <m1:sourceTime>2001-12-17T09:30:47.0Z</m1:sourceTime>
          <m1:vendorExtensions/>
          <m2:objectName>
            <nam:object>
              <nam:type>MD</nam:type>
              <nam:name>Company/String</nam:name>
            </nam:object>
            <nam:object>
              <nam:type>ME</nam:type>
              <nam:name>String</nam:name>
            </nam:object>
          </m2:objectName>
          <m2:osTime>2001-12-17T09:30:47.0Z</m2:osTime>
          <!-- Examples used below cover all object attribute datatypes expected to be found in attributeList
                based on SD2-14_AVC_SC_Notifications.doc -->
          <m3:simpleAttributeList>
            <nam:nvsList>
              <!-- all object attributes based on simpleType elements are captured here -->
              <nam:nvs>
                <!-- Object userLabel value is changed -->
                <nam:name>userLabel</nam:name>
                <nam:value>new_value</nam:value>
              </nam:nvs>
              <nam:nvs>
                <!-- Object softwareVersion value is changed -->
                <nam:name>softwareVersion</nam:name>
                <nam:value>new_value</nam:value>
              </nam:nvs>
              <nam:nvs>
                <!-- Object resourceState value is deleted -->
                <nam:name>resourceState</nam:name>
                <nam:value xsi:nil="true"/>
              </nam:nvs>
            </nam:nvsList>
          </m3:simpleAttributeList>
          <m3:complexAttributeList>
            <gen:nv>
              <gen:attributeName>aliasNameList</gen:attributeName>
              <gen:aliasNameList xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1">
                <!-- Changes in Object aliasNameList attribute  -->
                <gen:alias>
                  <!-- Object aliasName=meLabel1 value is deleted -->
                  <gen:aliasName>meLabel1</gen:aliasName>
                  <gen:aliasValue xsi:nil="true"/>
                </gen:alias>
                <gen:alias>
                  <!-- Object aliasName=meLabel2 value is changed -->
                  <gen:aliasName>meLabel2</gen:aliasName>
                  <gen:aliasValue>new_value</gen:aliasValue>
                </gen:alias>
              </gen:aliasNameList>
            </gen:nv>
            <gen:nv>
              <gen:attributeName>supportedConnectionLayerRateList</gen:attributeName>
              <lr:layerRateListType xmlns:lr="http://www.tmforum.org/mtop/nrb/xsd/lay/v1">
                <!-- Changes in Object  attribute  -->
              </lr:layerRateListType>
            </gen:nv>
            <gen:nv>
              <gen:attributeName>transmissionParams</gen:attributeName>
              <lp:transmissionParams xmlns:lp="http://www.tmforum.org/mtop/nrb/xsd/lp/v1">
                <!-- Changes in Object transmissionParams attribute  -->
                <lp:layeredParameters>
                  <lp:layer extension="myLayerRate">VENDOR_EXT</lp:layer>
                  <lp:transmissionParams>
                    <nam:nvs>
                      <!-- Object transmissionParams(myLayerRate).param1 value is deleted -->
                      <nam:name>param1</nam:name>
                      <nam:value xsi:nil="true"/>
                    </nam:nvs>
                    <nam:nvs>
                      <!-- Object transmissionParams(myLayerRate).param2 value is changed -->
                      <nam:name>param2</nam:name>
                      <nam:value>new_value</nam:value>
                    </nam:nvs>
                  </lp:transmissionParams>
                  <lp:vendorExtensions/>
                </lp:layeredParameters>
              </lp:transmissionParams>
            </gen:nv>
            <gen:nv>
              <gen:attributeName>vendorExtensions</gen:attributeName>
              <gen:vendorExtensions xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1" xmlns:vd="www.vendor.com">
                <!-- Changes in Object vendorExtensions attribute  -->
                <!-- Object vendorExtensions myParam1 attribute is deleted -->
                <vd:myParam1 xsi:nil="true"/>
                <!-- Object vendorExtensions myParam2 attribute value is changed -->
                <vd:myParam2>new_value</vd:myParam2>
              </gen:vendorExtensions>
            </gen:nv>
          </m3:complexAttributeList>
          <m0:edgePointRelated>false</m0:edgePointRelated>
        </m0:resourceAttributeValueChange>
      </m:message>
    </m:notify>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
